var 线程ID
//从这里开始执行
function 执行()
    //从这里开始你的代码
    
    
    //判断程序是否超期
    var NowTime=当前时间()
    var OverTime="2021-04-29"
    var BtTime=时间间隔("h",NowTime,OverTime)
    
    if(BtTime<0)
        //messagebox("软件权限过期")
        exit()
    end
    
    //    //定义验证图片数组
    //    
    //    var yzPic=array("p1","p2","p3")
    //    
    //    var ShowPic="p3"
    
    
    //    var Length=数组大小(yzPic)
    //    for(var i=0;i<Length;i++)
    //        
    //        if(ShowPic==yzPic[i])
    //            messagebox("第三张图片")
    //        end
    //    
    //    end
    
    
    //开始正式运行打怪
    
    字库设置("F:/k2.txt",0)
    
    var fx=1    
    
    var myX,myY
    var My_ret = 找字(15,100,875,600,"兑","ffffff-000000",1.0,myX,myY) //定位自己角色的位置
    
    //定位人物中心坐标
    myX=341
    myY=293
    
    //定位人物寻怪范围
    var minX=myX-200,maxX=myX+200 
    var minY=myY-150,maxY=myY+150
    
    
    
    //这里开始执行挂机代码
    for(var j=0;j<10;j++)
        
        sleep(200) //加点延迟防止死机
        
        //判断是否回收装备
        if(j==5)
            
            //            超级键盘按键(52,1)
            //            sleep(200)
            //            var x=-1,y=-1
            //            var hs_ret=找图(15,41,875,600,"F:/gjpic/hs3.BMP","101010",1,0,x,y)
            //            
            //            
            //            if(hs_ret>=0)
            //                鼠标弧线移动(x+15,y+5)
            //                sleep(200)
            //                超级鼠标左键单击(1)
            //                标签设置文本("标签2","回收成功")
            //            else
            //                标签设置文本("标签2",hs_ret)
            //            end
            //            超级键盘按键(27,1)
            j=0
        end
        
        //---回收完成        
        
        //开始寻怪,用字库模式找怪
        sleep(200)
        var x=-1,y=-1
        
        
        //变量 ret=找图(minX,minY,maxX,maxY,"F:/gjpic/xt.bmp","303030",0.5,0,x,y)
        //变量 ret=findcolor(minX,minY,maxX,maxY,"CB0000",1,0,x,y)
        //变量 ret = 找字(15,41,875,600,"龙","ffffff-000000",1.0,x,y) //记得要加色域区间
        //变量 ret = 找字(15,41,875,600,"龙","ffffff-000000",1.0,x,y) //记得要加色域区间
        //变量 字体颜色备注ff00ff紫色
        
        //内圈找怪
        变量 ret = 找字(myX-50,myY-50,myX+50,myY+50,"王|贵|域|占|水|马|龙","ffffff-000000",1.0,x,y) //记得要加色域区间
        
        //内圈无怪的话还是内圈捡东西
        if(x<0)
            ret = 找字(myX-50,myY-50,myX+50,myY+50,"头|王|者|贵|域|占|水|马|龙|页","f0b42a-000000|efb229-000000",1.0,x,y) //记得要加色域区间
        end
        
        //内圈无东西,开始外圈找怪
        
        ret = 找字(minX,minY,maxX,maxY,"王|贵|域|占|水|马|龙","ffffff-000000",1.0,x,y) //记得要加色域区间
        
        
        
        if(x>0)
            //寻怪成功,开始打款
            标签设置文本("标签2","开始打怪")
            鼠标弧线移动(x+15,y+20)
            超级鼠标左键单击(1) //战士作家点击攻击
            //超级键盘按键(113,1) //道士用F2攻击
            sleep(1500)
            
            
        else
            
            //判断方向正反跑
            
            var zdx,zdy
            var iszd_ret=找图(15,41,875,600,"F:/gjpic/zddt2.BMP","101010",1,0,zdx,zdy)
            
            if(zdx>0)
                fx=0
                标签设置文本("标签2","去起点")
            end
            
            
            var qdx,qdy
            var isqd_ret=找图(15,41,875,600,"F:/gjpic/qddt.BMP","101010",1,0,qdx,qdy)            
            
            if(qdx>0)
                fx=1
                标签设置文本("标签2","去终点")
            end            
            
            //地图上没有怪物,打开地图寻怪
            
            
            //鼠标弧线移动(23,130)
            //超级键盘按键(77)
            
            
            sleep(200)
            
            var zdX,zdY
            if(fx==1)
                
                var hs_ret=找图(15,41,875,600,"F:/gjpic/zd.BMP","101010",1,0,zdX,zdY)
                
            else
                
                var hs_ret=找图(15,41,875,600,"F:/gjpic/qd.BMP","101010",1,0,zdX,zdY)
                
            end
            
            if(zdX>0)   
                鼠标弧线移动(zdX,zdY)
                sleep(100)
                超级鼠标左键单击(1)
                超级键盘按键(27)
                
            else
                超级键盘按键(27)
                //没有地图的情况下,随机跑             
                
                //随机传送
                // 键盘按键(49)
                
                var nowX=随机数(minX,maxX)
                var nowY=随机数(minY,maxY)
                
                for(var n=0;n<100;n++)
                    
                    var NowColor=取色(nowX,nowY,1)
                    
                    标签设置文本("标签3","当前颜色")
                    if(NowColor=="080000"||NowColor=="000000")
                        
                        nowX=随机数(minX,maxX)
                        nowY=随机数(minY,maxY)
                        标签设置文本("标签3","区域不可行走,重新定位")
                        
                    else
                        n=100 //跳出循环
                    end
                    n++
                end
                
                sleep(100)
                鼠标弧线移动(nowX,nowY)
                超级鼠标右键按下()
                
                sleep(2500)
                超级鼠标右键弹起()              
            end
            
        end	
        
        //寻怪打怪完成
    end
    
end
//启动_热键操作等待
function 启动_热键()
    线程ID=threadbegin("执行","")
end

//终止热键操作
function 终止_热键()
    threadclose(线程ID)
end


功能 鼠标弧线移动(目标x, 目标y)
    //每次移动步长要随机,每次移动间隔时间要随机,每次移动产生偏移量要随机,
    变量 当前x, 当前y, 距离x, 距离y, 两点直线距离, 移动x, 移动y, 随机量, 移动次数, 移动步长x, 移动步长y, 方位x, 方位y, 移动成功 = 0
    变量 最大值, 最小值, 顺序, 数值 = 0
    顺序 = 随机数(0, 1)
    最大值 = 随机数(20, 60)
    最小值 = 随机数(-60, -20)
    循环(真)
        鼠标获取坐标(当前x, 当前y)
        距离x = 数学绝对值(当前x - 目标x)//x边长
        距离y = 数学绝对值(当前y - 目标y)//y边长
        两点直线距离 = 数学开方(距离x * 距离x + 距离y * 距离y)//斜边边长
        循环(真)
            随机量 = 随机数(3, 20)
            移动次数 = 两点直线距离 / 随机量
            如果(移动次数 >= 1)
                移动步长x = 距离x / 移动次数
                移动步长y = 距离y / 移动次数
                跳出
            否则
                鼠标移动(目标x, 目标y)
                移动成功 = 1
                跳出
            结束
        结束
        如果(移动成功 == 1)
            跳出
        结束
        方位x = 目标x - 当前x
        如果(方位x > 0)
            方位x = 1
        否则
            方位x = -1
        结束
        方位y = 目标y - 当前y
        如果(方位y >= 0)
            方位y = 1
        否则
            方位y = -1
        结束
        如果(顺序 == 0)
            数值 = 数值 + 2 
            如果(数值 >= 最大值)
                最大值 = 随机数(20, 60)
                最小值 = 随机数(-60, -20)
                数值 = 0
                顺序 = 1
                移动y = 当前y + 移动步长y * 方位y 
                移动x = 当前x + 移动步长x * 方位x
            否则
                移动y = 当前y + 移动步长y * 方位y + 2
                移动x = 当前x + 移动步长x * 方位x + 2
            结束
        结束
        如果(顺序 == 1)
            数值 = 数值 - 2 
            如果(数值 <= 最小值)
                最大值 = 随机数(20, 60)
                最小值 = 随机数(-60, -20)
                数值 = 0
                顺序 = 0
                移动y = 当前y + 移动步长y * 方位y 
                移动x = 当前x + 移动步长x * 方位x
            否则
                移动y = 当前y + 移动步长y * 方位y - 2
                移动x = 当前x + 移动步长x * 方位x - 2
            结束
        结束
        鼠标移动(移动x, 移动y)
        如果(移动x - 目标x < 40)//靠近目标点进行减速移动
            等待(随机数(10, 30))
        否则
            等待(随机数(5, 10))
        结束
    结束
结束
